[
  {
    "title": "Spider's Web",
    "author": "Charles Osborne;Agatha Christie",
    "categories": "Detective and mystery stories",
    "thumbnail": "http://books.google.com/books/content?id=gA5GPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "A new 'Christie for Christmas' -- a full-length novel adapted from her acclaimed play by Charles Osborne Following BLACK COFFEE and THE UNEXPECTED GUEST comes the final Agatha Christie play novelisation, bringing her superb storytelling to a new legion of fans. Clarissa, the wife of a Foreign Office diplomat, is given to daydreaming. 'Supposing I were to come down one morning and find a dead body in the library, what should I do?' she muses. Clarissa has her chance to find out when she discovers a body in the drawing-room of her house in Kent. Desperate to dispose of the body before her husband comes home with an important foreign politician, Clarissa persuades her three house guests to become accessories and accomplices. It seems that the...",
    "published_year":"2000",
    "average_rating": 3.85,
    "page_count": 241,
    "user_id": 1
  },
  {
    "title": "If Tomorrow Comes",
    "author": "Sidney Sheldon",
    "categories": "Adventure stories",
    "thumbnail": "http://books.google.com/books/content?id=l2tBi_jLuk8C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "One of Sidney Sheldon's most popular and bestselling titles, repackaged and reissued for a new generation of fans...",
    "published_year":"1994",
    "average_rating": 4.04,
    "page_count": 501,
    "user_id": 1
  },
  {
    "title": "The Chronicles of Narnia: Lion, the witch and the wardrobe",
    "author": "Clive Staples Lewis",
    "categories": "Fairy tales",
    "thumbnail": "http://books.google.com/books/content?id=5WNRJAFEjLYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Includes an author biography, chapter summaries, vocabulary builders, reproducibles, and cross-curricular activities for students of all learning styles for Lewis's tale \"The Lion, the Witch, and the Wardrobe...",
    "published_year":"1978",
    "average_rating": 4.26,
    "page_count": 1425,
    "user_id": 2
  },
  {
    "title": "Lincoln's Sword",
    "author": "Douglas L. Wilson",
    "categories": "History",
    "thumbnail": "http://books.google.com/books/content?id=5u25mVscD5MC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Widely considered in his own time as a genial but provincial lightweight who was out of place in the presidency, Abraham Lincoln astonished his allies and confounded his adversaries by producing a series of speeches and public letters so provocative that they helped revolutionize public opinion on such critical issues as civil liberties, the use of black soldiers, and the emancipation of slaves. This is a brilliant and unprecedented examination of how Lincoln used the power of words to not only build his political career but to keep the country united during the Civil War.",
    "published_year":"2011-11-02",
    "average_rating": 4.5,
    "page_count": 352,
    "user_id": 1
  },
  {
    "title": "Silver, Sword, and Stoned",
    "author": "Marie Arana",
    "categories": "History",
    "thumbnail": "http://books.google.com/books/content?id=6yamDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Winner, American Library Association Booklist’s Top of the List, 2019 Adult Nonfiction Longlisted for the 2020 Andrew Carnegie Medals for Excellence Against the background of a thousand years of vivid history, acclaimed writer Marie Arana tells the timely and timeless stories of three contemporary Latin Americans whose lives represent three driving forces that have shaped the character of the region: exploitation (silver), violence (sword), and religion (stone)...",
    "published_year":"2020-08-18",
    "average_rating": 3,
    "page_count": 496,
    "user_id": 4
  },
  {
    "title": "Fifty Shades Trilogy",
    "author": "E. L. James",
    "categories": "Fiction",
    "thumbnail": "http://books.google.com/books/content?id=ZTiNEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "When Anastasia Steele, a young literature student, interviews wealthy young entrepreneur Christian Grey for her campus magazine, their initial meeting introduces Anastasia to an exciting new world that will change them both forever...",
    "published_year":"2011",
    "average_rating": 4,
    "page_count": 514,
    "user_id": 3
  }
]